
Процедура ТестОформителяОтступов(Парам1, Парам2)
	
	#Область АргументыДолжныВыравниваться
	
	Результат = новый Структура("НачалоСтроки,КонецСтроки,Лирика");
	Результат.НачалоСтроки = 1;
	Результат.КонецСтроки = 2;
	Результат.лирика = 3;
	
	Для ц=1 по 10 цикл
	
		Стр = новый Структура();
		Стр.Вставить("Результат1", п);
		Стр.Вставить("Резу", п1);
		Стр.Вставить("Рез", п2);
	
	КонецЦикла;
	
	Запрос = новый Запрос();
	Запрос.Параметры.Вставить("П1", 1);
	Запрос.Параметры.Вставить("БольшойПараметр2", 2);
	Запрос.Параметры.Вставить("Парам3", 2);
	
	#КонецОбласти
	
	#Область АргументыНеДолжныВыравниваться
	// Баг #1
	Результат = новый Структура("НачалоСтроки,КонецСтроки,Лирика");
	Если Истина Тогда
		
		Результат.НачалоСтроки = 1;
		Результат.КонецСтроки = 2;
		
	Иначе
		
		Результат.лирика = 3;
		
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры
